# MepUpperTopElevationIncludeInsulation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepUpperTopElevationIncludeInsulation Property
ParameterTypeId Class See Also
---
"Upper End Top of Insulation Elevation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepUpperTopElevationIncludeInsulation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepUpperTopElevationIncludeInsulation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepUpperTopElevationIncludeInsulation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace